#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:966137945144:cluster/with-s3]
aws_vpc.vpc: Refreshing state... [id=vpc-0989f2e5f9eb0987a]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=with-s3-log-group]
aws_launch_template.ecs_launch_template: Refreshing state... [id=lt-02407079ca4ec2e1e]
aws_ecs_task_definition.task_definition: Refreshing state... [id=with-s3]
aws_subnet.subnet_2: Refreshing state... [id=subnet-098ed672750db43dd]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-00d71d1890f3a3d86]
aws_subnet.subnet_1: Refreshing state... [id=subnet-03e4760d4f4a7da88]
aws_alb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:966137945144:targetgroup/with-s3/07221ec99cad1c45]
aws_security_group.alb: Refreshing state... [id=sg-09f56c8b8cb67eac4]
aws_route_table.route_table: Refreshing state... [id=rtb-0d026f81d69bfd56c]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0502965c475899a08]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:966137945144:loadbalancer/app/with-s3/d94e0f588b83f6be]
aws_autoscaling_group.ecs_asg: Refreshing state... [id=with-s3-asg]
aws_route_table_association.route_table_association_2: Refreshing state... [id=rtbassoc-07ae6eea077f4b1d2]
aws_route_table_association.route_table_association_1: Refreshing state... [id=rtbassoc-0b403c2d19a791b14]
aws_alb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:966137945144:listener/app/with-s3/d94e0f588b83f6be/1001d40731747de5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_autoscaling_group.ecs_asg has changed
  ~ resource "aws_autoscaling_group" "ecs_asg" {
      + arn                       = "arn:aws:autoscaling:eu-west-1:966137945144:autoScalingGroup:da6b123e-db4d-4244-a4b8-66c3a6bc04a3:autoScalingGroupName/with-s3-asg"
        id                        = "with-s3-asg"
        name                      = "with-s3-asg"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_target.ecs will be created
  + resource "aws_appautoscaling_target" "ecs" {
      + id                 = (known after apply)
      + max_capacity       = 5
      + min_capacity       = 1
      + resource_id        = "service/with-s3/with-s3"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_autoscaling_group.ecs_asg is tainted, so must be replaced
-/+ resource "aws_autoscaling_group" "ecs_asg" {
      ~ arn                       = "arn:aws:autoscaling:eu-west-1:966137945144:autoScalingGroup:da6b123e-db4d-4244-a4b8-66c3a6bc04a3:autoScalingGroupName/with-s3-asg" -> (known after apply)
      ~ availability_zones        = [
          - "eu-west-1a",
          - "eu-west-1b",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - default_instance_warmup   = 0 -> null
      - enabled_metrics           = [] -> null
      ~ id                        = "with-s3-asg" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
        name                      = "with-s3-asg"
      + name_prefix               = (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::966137945144:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
        # (11 unchanged attributes hidden)

      ~ instance_refresh {
          - triggers = [] -> null
            # (1 unchanged attribute hidden)
        }

      ~ launch_template {
            id      = "lt-02407079ca4ec2e1e"
          ~ name    = "with-s3-lt" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_ecs_capacity_provider.ecs_cp will be created
  + resource "aws_ecs_capacity_provider" "ecs_cp" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "with-s3-cp"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = 30
              + maximum_scaling_step_size = 10
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 100
            }
        }
    }

  # aws_ecs_cluster_capacity_providers.ecs_cluster_cp will be created
  + resource "aws_ecs_cluster_capacity_providers" "ecs_cluster_cp" {
      + capacity_providers = [
          + "with-s3-cp",
        ]
      + cluster_name       = "with-s3"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "with-s3-cp"
          + weight            = 100
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:eu-west-1:966137945144:cluster/with-s3"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "with-s3"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:eu-west-1:966137945144:task-definition/with-s3:1"
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "with-s3-cp"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "site"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:966137945144:targetgroup/with-s3/07221ec99cad1c45"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0502965c475899a08",
              + "sg-09f56c8b8cb67eac4",
            ]
          + subnets          = [
              + "subnet-03e4760d4f4a7da88",
              + "subnet-098ed672750db43dd",
            ]
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cscleison, Action: `pull_request`, Working Directory: `./apps`, Workflow: `Pull Request Workflow`*